aa8764114/nRF5_SDK/examples/my_project/ble_app_blinky_fds3/main.c
/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {LEDBUTTON_BUTTON, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

#define CONFIG_FILE     (0x8010)
#define CONFIG_REC_KEY  (0x7010)

static bool volatile m_fds_initialized;

static struct
{
    bool delete_next;   //!< Delete next record.
    bool pending;       //!< Waiting for an fds FDS_EVT_DEL_RECORD event, to delete the next record.
} m_delete_all;

typedef struct
{
    uint32_t boot_count;
    char     device_name[16];
    bool     config1_on;
    bool     config2_on;
} configuration_t;

static configuration_t m_dummy_cfg =
        {
                .config1_on  = false,
                .config2_on  = true,
                .boot_count  = 0x0,
                .device_name = "dummy",
        };

static fds_record_t const m_dummy_record =
        {
                .file_id           = CONFIG_FILE,
                .key               = CONFIG_REC_KEY,
                .data.p_data       = &m_dummy_cfg,
                /* The length of a record is always expressed in 4-byte units (words). */
                .data.length_words = (sizeof(m_dummy_cfg) + 3) / sizeof(uint32_t),
        };


static void fds_evt_handler(fds_evt_t const * p_evt)
{
    switch (p_evt->id)
    {
        case FDS_EVT_INIT:
            if (p_evt->result == NRF_SUCCESS)
            {
                m_fds_initialized = true;
            }
            break;

        case FDS_EVT_WRITE:
        {
            if (p_evt->result == NRF_SUCCESS)
            {
                NRF_LOG_INFO("Record ID:\t0x%04x",  p_evt->write.record_id);
                NRF_LOG_INFO("File ID:\t0x%04x",    p_evt->write.file_id);
                NRF_LOG_INFO("Record key:\t0x%04x", p_evt->write.record_key);
            }
        } break;

        case FDS_EVT_DEL_RECORD:
        {
            if (p_evt->result == NRF_SUCCESS)
            {
                NRF_LOG_INFO("Record ID:\t0x%04x",  p_evt->del.record_id);
                NRF_LOG_INFO("File ID:\t0x%04x",    p_evt->del.file_id);
                NRF_LOG_INFO("Record key:\t0x%04x", p_evt->del.record_key);
            }
            m_delete_all.pending = false;
        } break;

        default:
            break;
    }
}

static void power_manage(void)
{
#ifdef SOFTDEVICE_PRESENT
    (void) sd_app_evt_wait();
#else
    __WFE();
#endif
}

static void wait_for_fds_ready(void)
{
    while (!m_fds_initialized)
    {
        power_manage();
        NRF_LOG_INFO("wait_for_fds_ready");
    }
}


/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize.
    log_init();
    leds_init();
    timers_init();
    buttons_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("Blinky example started.");

    NRF_LOG_INFO("FDS example started.")

/* Register first to receive an event when initialization is complete. */
    (void) fds_register(fds_evt_handler); //註冊FDS

    NRF_LOG_INFO("Initializing fds...");

    ret_code_t rc;
    rc = fds_init();    //初始化FDS
    APP_ERROR_CHECK(rc);

/* Wait for fds to initialize. */
    wait_for_fds_ready();   //等待FDS初始化完成

    fds_record_desc_t desc = {0};   //透過他拿到要拿到的內部儲存空間在哪
    fds_find_token_t  tok  = {0};

    rc = fds_record_find(CONFIG_FILE, CONFIG_REC_KEY, &desc, &tok); //找到要讀取的內部儲存空間位址

    if (rc == NRF_SUCCESS)  //如果有找到
    {
        /* A config file is in flash. Let's update it. */
        fds_flash_record_t config = {0};    //從內部儲存空間讀到的資料會放這裡

        /* Open the record and read its contents. */
        rc = fds_record_open(&desc, &config);   //打開儲存空間中的內容
        APP_ERROR_CHECK(rc);

        /* Copy the configuration from flash into m_dummy_cfg. */
        //m_dummy_cfg:存要記錄資訊的結構
        memcpy(&m_dummy_cfg, config.p_data, sizeof(configuration_t));   //把弄到的儲存空間內容複製到RAM中

        NRF_LOG_INFO("Config file found, updating boot count to %d.", m_dummy_cfg.boot_count);  //印出當前的重開次數

        /* Update boot count. */
        m_dummy_cfg.boot_count++;   //重開次數+1

        /* Close the record when done reading. */
        rc = fds_record_close(&desc);   //關檔
        APP_ERROR_CHECK(rc);

        /* Write the updated record to flash. */
        //m_dummy_record裡面的欄位用指標接到m_dummy_cfg
        rc = fds_record_update(&desc, &m_dummy_record); //更新內部儲存空間中的內容
        if ((rc != NRF_SUCCESS) && (rc == FDS_ERR_NO_SPACE_IN_FLASH))
        {
            NRF_LOG_INFO("No space in flash, delete some records to update the config file.");
        }
        else
        {
            APP_ERROR_CHECK(rc);
        }
    }
    else     //如果沒搜尋到
    {
        /* System config not found; write a new one. */
        NRF_LOG_INFO("Writing config file...");

        rc = fds_record_write(&desc, &m_dummy_record);  //直接把m_dummy_record的內容寫入內部儲存空間
        if ((rc != NRF_SUCCESS) && (rc == FDS_ERR_NO_SPACE_IN_FLASH))
        {
            NRF_LOG_INFO("No space in flash, delete some records to update the config file.");
        }
        else
        {
            APP_ERROR_CHECK(rc);
        }
    }

    advertising_start();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
